Backrooms/src/Catalogs/ЗданияОрганизации/ЗданияОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗданияОрганизации</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВремяРаботыПоУмолчанию</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОткрытияПоУмолчанию</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗакрытияПоУмолчанию</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Backrooms/src/Catalogs/ЗданияОрганизации/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ВремяРаботыПоУмолчаниюВыходнойПриИзмененииНаСервере()
	Инд = Элементы.ГрафикРаботы.ТекущаяСтрока;
	Если Объект.ГрафикРаботы[Инд].Выходной Тогда
		Объект.ГрафикРаботы[Инд].ВремяОткрытия = '00010101 12:00:00';
		Объект.ГрафикРаботы[Инд].ВремяЗакрытия = '00010101 12:00:00';
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяРаботыПоУмолчаниюВыходнойПриИзменении(Элемент)
	ВремяРаботыПоУмолчаниюВыходнойПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = ПараметрыСеанса.Пользователь.Организация;
	Если НЕ Объект.ВремяРаботыПоУмолчанию.Количество() Тогда
		Для Каждого ДН ИЗ Перечисления.ДниНедели Цикл
			НовСтр = Объект.ВремяРаботыПоУмолчанию.Добавить();
			НовСтр.ДеньНедели = ДН;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
